start = """👋 Привет! Я новый телеграм-бот 🤖. Моя цель — помочь вам найти необходимую информацию и ответить на все интересующие вас вопросы.

💡 Вот несколько вещей, которые я могу для вас сделать:

📚 Предоставить справочную информацию по интересующим вас темам.
❓ Ответить на ваши вопросы.
🖥️ Предоставить информацию о школе, ее услугах, процессах работы.

📋 Вот как вы можете взаимодействовать со мной:

🌟Воспользуйтесь кнопками предложенными снизу, в них вы можете найти необходимую для вас информацию.
Если вы не смогли найти нужную для вас информацию, вы можете связаться с администрацией."""



info_payment = """"""



how_to_pay = """Вы оплачиваете каждый период/абонемент (8 занятий по утвержденному расписанию), каждые 28 дней, в последний день предыдущего оплаченного периода. Мы будем об этом напоминать. Если нет возможности оплатить в срок предупредите, мы подождем, занятия при этом не приостанавливаем.
Новогодние, майские и летние каникулы исключение,
когда абонемент можно заморозить. В остальное время оплата идет каждые 8 занятий по расписанию.

Пропущенные основные занятия по любым причинам у вас не сгорают, а отрабатываются, вне расписания, по договоренности с педагогом, без привязке к оплате периодов. По запросу мы пришлем вам варианты, когда можно подключиться на отработку. Отработки проводятся в другой группе при наличии свободного места, либо индивидуально, но длительностью 45 минут. Если нет возможности отработать в учебное время, то копим пропуски и отрабатываем во время школьных каникул.

При покупке нескольких периодов предоставляем
скидки. Когда по вашей рекомендации к нам придет новый ученик - фиксированная скидка 2500 рублей на один период.

При решении сделать паузу в занятиях более трех недель без оплаты будущих уроков место в группе открепляется, и по возвращению если место занято - подбирается новая группа или педагог.

В группе: От 8 000 р./мес

Наставничество: От 10 000 р./мес"""



education_info = """Ребята от 9 до 17 обучаются в мини-группах до 4-х человек. С ними наставник-педагог.
Программа состоит из модулей, в модулях лежат проекты, проекты поделены на шаги, в шаги вложена необходимая информация (статьи, ссылки, документация), необходимая к изучению для
выполнения шага.

По завершению проект отправляется на проверку. Проверяют действующие программисты и пишут ревью-код.
    
После принятия открывается следующий проект модуля. Если пришли правки, то нужно доработать проект.
    
Время проверки - от 3 до 24 часов. Пока проверяется проект одного модуля, выполняем проект другого модуля программы.

Педагог будет помогать с возникшими вопросами, следить за происходящим, комментировать, объяснять при трудностях, курировать задачи.

Материалы на платформе в доступен и вне занятий. Домашнее задание обычно - несколько шагов самостоятельно. От самостоятельной работы напрямую зависит скорость прогресса. Больше уделяет времени программированию - быстрее проходит программу. На урок можно подключаться уже с возникшими вопросами по задачам."""



support_info = """Спасибо Вам, что выбрали нашу школу и доверили своего ребенка на обучение. Мы будем прикладывать все усилия, чтобы дать максимальный результат и добиться поставленных Вами целей

Что дальше?
Дальше у нас наступает первый месяц адаптации. Месяц, когда ученик знакомится ближе с педагогом, правилами группы, форматом обучения, своими обязанностями, и самое главное - начинает сталкиваться с первыми трудностями.	

Наша совместная задача, родителя и куратора - держать руку на пульсе и сразу реагировать на все замечания и комментарии ребенка на любые моменты
образовательного процесса. Это позволит понимать ситуацию и вносить изменения в работу, что снизит стресс у ребенка и поможет быстрее влиться в процесс.

Пишите пожалуйста, обратную связь и не бойтесь критиковать.
По всем вопросам - обращайтесь, с удовольствием
ответим.

Мы здесь на связи с Вами с 9 до 20 по Москве в будни и с 10 до 19 в выходные дни. Куратор при необходимости будет Вам звонить, обсуждать процесс обучения."""




general_information = """Общая информация
За курс, студент изучит разработку проектов на Python, работу с командной строкой, API веб-сервисов, верстку сайтов, HTML и CSS. Научится работать в среде разработки, настраивать виртуальное окружение и напишет более 20 проектов: «Чат-бот в Telegram», «Магазин шапок», «Сайт онлайн библиотеки», «Видеоплеер», «Парсеры с HH и SuperJob». Привыкнет изучать самостоятельно информацию и документацию к проекту."""



soft_skills_after_training = """Soft Skills после обучения:
Вдумчивое чтение, понимание текста и что требуется взять из него
Целеполагание и разработка проектов до результата
Логическое и абстрактное мышление
Работа с документацией и опыт программирования
Уверенность в своих силах и мотивация к развитию
Понимание полученных навыков и перспектив применения"""



hard_skills_after_training = """Hard skills после обучения:
Уверенное владение языком Python
Разработка web-сервисов и сайтов
Знание HTML, CSS, Bootstrap
Парсинг сайтов
Работа с API сервисов
Сбор и обработка информации.
Работа с командной строкой Linux.
Права доступа, работа с директорией
Работа в среде разработки, Repl.it, Pycharm, Brackets
Работа с Git и Github, создание репозиториев,форки и пул-реквесты"""



activities_available = """Занятия с наставником
1 месяца / 8 занятий / 8 учебных часов

Занятия — онлайн-занятия в группе до 4-х учеников с наставником
по индивидуальной траектории обучения. С целью эффективного
изучения теории и её закрепления через создание проектов и
выполнение задач, поставленных на обучение.
                              
                              
                              
Хакатон
1 проект / 3 дней
 
Хакатон — ежемесячное онлайн-соревнование на 3 дня на котором, ребята
делают проекты от заказчика. За выполнение в срок получают призы и
сертификаты. С каждым участником персонально работает наставник.
                              
                              
                              
Клуб
1 месяц / 8 занятий / 16 учебных часа
 
Клуб — онлайн-встречи, на которых до 25 ребят встречаются 2 раза в
неделю по 2 часа, делают домашнюю работу, выполняют собственные
проекты, готовятся к соревнованиям и общаются на интересующие темы.
                              
                              
                              
Стажировка/Командный проект
10 дней / 20 учебных часов
                      
Ребята с желанием попробовать свои силы по пройденному материалу,
выполняют под руководством наставника до 5 проектов по ТЗ в течение 
2-х недель с понедельника по пятницу. Как результат резкий рост
мотивации к дальнейшему обучению.
                              
                              

Спецкурсы
Эксклюзивные мини-курсы, которые не находятся в открытом доступе
на платформе. набор на них производим 2 раза в год. Об актуальных
спецкурсах на лето уточните у куратора."""


summer_easy = """Для тех, кто хочет быстро пройти материал,
поучаствовать в стажировке и успеть отдохнуть
                              
Занятия с наставником
1 месяца / 8 занятий / 8 учебных часов
                              
Стажировка/Спецкурс
2 недели

Клуб
1 месяц / 8 занятий / 16 учебных часа
                              
2 Хакатона
2 проекта / 6 дней

                                      
В результате:
    1. Ученик применит полученные знания и повысит уверенность в своих силах
    2. Опыт участия в соревнованиях и в самостоятельной разработке
    3. Поднимется интерес и мотивация к обучению
    4. Пройдет программу на 20% быстрее и успеет отдохнуть летом
    5. С пользой проведет время, вместо YouTube и игр"""


time_active = """"Пакет «Активное время»
                              
Для тех, кто хочет заниматься круглый год и не пропустить занятия летом,
чтобы каникулы провести с пользой и участвовать в соревнованиях
                              
                              
Что входит в пакет?
                              
Стажировка/Спецкурс
2 недели
                              
3 Хакатона
3 проекта / 9 дней
                              
Клуб 
4 месяца / 32 занятий / 64 учебных часа
                              
Занятия с наставником
4 месяца / 32 занятий / 32 учебных часов

                              
В результате ваш ребёнок:
* Получит первый опыт разработки, который сверстники получат только на 2-м курсе ВУЗа
* Выполнит первые проекты по ТЗ в команде под руководством программиста
* Научится планировать свое время и организовывать процесс разработки
* Получит опыт участия в соревнованиях и в самостоятельной разработке
* Поднимет интерес и мотивацию к обучению на соревнованиях
* Применит полученные знания и повысит уверенность в ссвоих силах
* Пройдет программу на 20% быстрее, чем сверстники
* С пользой проведет время, вместо YouTube и игр 
* Найдет новых друзей с общими интересами
* Приблизится к оплачеваемой стажировке"""


info_intensive = """Пакет «Интенсив»
                              
Для ребят, кому нравится формат интенсивов и кто хочет
за лето пройти как можно больше программы и отдохнуть 
                              
                              
Что входит в пакет?
                              
Стажировка/Спецкурс
2 недели
                              
Клуб 
3 месяца / 24 занятий / 48 учебных часа
                              
3 Хакатона
3 проекта / 9 дней
                              
Занятия с наставником
2 месяца / 16 занятий / 16 учебных часов
                              
В результате ваш ребёнок:
* Получит первый опыт разработки, который сверстники получат только на 2-м курсе ВУЗа
* Выполнит первые проекты по ТЗ в команде под руководством программиста
* Научится планировать свое время и организовывать процесс разработки
* Получит опыт участия в соревнованиях и в самостоятельной разработке
* Поднимет интерес и мотивацию к обучению на соревнованиях
* Применит полученные знания и повысит уверенность в ссвоих силах
* Пройдет программу на 20% быстрее, чем сверстники
* С пользой проведет время, вместо YouTube и игр 
* Найдет новых друзей с общими интересами
* Приблизится к оплачеваемой стажировке"""


info_mentoring = """Пакет «Наставничество»
                              
Для ребят, которые хотят в 2-3 раза быстрее пройти
годовую программу и перейти на следующую ступень
                              
                              
Что входит в пакет?
                              
Наставничество
От 2 до 6 часов в неделю
Формат обучения при котором оплачивается стоимость за годовую
программу, а не за учебные часы. У ребенка неограниченное количество
занятий в месяц для максимально быстрого прохождения программы.
Например, пройти годовую программу вместе 9 месяцев за 3 месяца.
                       
3 Хакатона
3 проекта / 9 дней
                                                  
Занятия с наставником
Неограниченное количество
                              
В результате ваш ребёнок:
* Быстрее сверстников пройдет программу и перейдет на следующий год
* Быстрее получит результат и сэкономит время, а вы деньги
* Бесплатно участвует во всех активностях: хакатоны, клубы, и тд."""


info_addition = """Допы от Клуба репетиторов

Кому нужно подтянуть школьную программу и разговорный
английский. У нас есть педагоги-партнеры по английскому
и математике. вы можете записаться к ним на занятия со
скидкой
                              
Доступные направления:
Английский
Математика
                              
В результате:
* Повышение успеваемости и уверености в школьных предметах.
* Практические навыки раговорного английского.
* Улучшение способности общаться на английском языке в повседневных ситуациях.
* Поднимется интерес и мотивация к обучению
* Пройдет программу на 20% быстрее, чем сверстники
* С пользой проведет время, вместо YouTube и игр"""

group = """Отличительная особенность - Работа в группе и домашняя работа

Количество групповых часов в неделю - 2 урока по 60 минут

Еженедельный воскресный вебинар - есть

График занятий - ПН-ВС: с 10-00 до 21-00 (МСК)

Скорость обучения от группового формата - 100%

Индивидуальная траектория обучения - есть

Обратная связь от куратора -  есть

Напоминания об уроках - есть

Работа с мотивацией - есть 

Отработка пропусков - В любой день и час

Самостоятельная работа - 2 часа в неделю   """

mentoring = """Отличительная особенность - Неограниченное количество часов, важно быстро пройти программу

Количество групповых часов в неделю - до 15 уроков по 60 минут

Еженедельный воскресный вебинар - есть

График занятий - ПН-ВС: с 10-00 до 21-00 (МСК)

Скорость обучения от группового формата - 200-400%

Индивидуальная траектория обучения - есть

Обратная связь от куратора -  есть

Напоминания об уроках - есть

Работа с мотивацией - есть 

Отработка пропусков - В любой день и час

Самостоятельная работа - 4-5 часов в неделю"""
